Revit 2027 API
DirectShape.AreValidDirectShapeReferenceOptions Method
 Validates that the input DirectShapeReferenceOptions are suitable for creating a direct shape reference object. If the options specify an ExternalGeometryId, it must not correspond to any existing reference object belonging to the DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreValidDirectShapeReferenceOptions(
	DirectShapeReferenceOptions options
)
Public Function AreValidDirectShapeReferenceOptions (
	options As DirectShapeReferenceOptions
) As Boolean
public:
bool AreValidDirectShapeReferenceOptions(
	DirectShapeReferenceOptions^ options
)
member AreValidDirectShapeReferenceOptions :
        options : DirectShapeReferenceOptions -> bool
Parameters
options DirectShapeReferenceOptions
 The options to test.
Return Value
Boolean
 True if the options can be used to add a reference object to this DirectShape.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace